Show / Hide Table of Contents
Class IdeaStatiCaClient<T>
Inheritance
System.Object
System.ServiceModel.ClientBase<T>
IdeaStatiCaClient<T>
Implements
System.ServiceModel.ICommunicationObject
System.IDisposable
Inherited Members
 System.ServiceModel.ClientBase<T>.GetDefaultValueForInitialization<T>()
 System.ServiceModel.ClientBase<T>.Open()
 System.ServiceModel.ClientBase<T>.Abort()
 System.ServiceModel.ClientBase<T>.Close()
 System.ServiceModel.ClientBase<T>.DisplayInitializationUI()
 System.ServiceModel.ClientBase<T>.CreateChannel()
 System.ServiceModel.ClientBase<T>.System.IDisposable.Dispose()
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.Open(System.TimeSpan)
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.Close(System.TimeSpan)
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.BeginClose(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.BeginClose(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.EndClose(System.IAsyncResult)
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.BeginOpen(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.BeginOpen(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.EndOpen(System.IAsyncResult)
 System.ServiceModel.ClientBase<T>.InvokeAsync(System.ServiceModel.ClientBase.BeginOperationDelegate<>, System.Object[], System.ServiceModel.ClientBase.EndOperationDelegate<>, System.Threading.SendOrPostCallback, System.Object)
 System.ServiceModel.ClientBase<T>.Channel
 System.ServiceModel.ClientBase<T>.CacheSetting
 System.ServiceModel.ClientBase<T>.ChannelFactory
 System.ServiceModel.ClientBase<T>.ClientCredentials
 System.ServiceModel.ClientBase<T>.State
 System.ServiceModel.ClientBase<T>.InnerChannel
 System.ServiceModel.ClientBase<T>.Endpoint
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.Closed
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.Closing
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.Faulted
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.Opened
 System.ServiceModel.ClientBase<T>.System.ServiceModel.ICommunicationObject.Opening
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class IdeaStatiCaClient<T> : ClientBase<T>, ICommunicationObject, IDisposable where T : class
Type Parameters
 Name |  Description
 T
Constructors
Improve this Doc   View Source
IdeaStatiCaClient(Binding, EndpointAddress)
Declaration
public IdeaStatiCaClient(Binding binding, EndpointAddress remoteAddress)
Parameters
 Type |  Name |  Description
 System.ServiceModel.Channels.Binding |  binding
 System.ServiceModel.EndpointAddress |  remoteAddress
Properties
Improve this Doc   View Source
Service
Declaration
public T Service { get; }
Property Value
 Type |  Description
 T
Implements
 System.ServiceModel.ICommunicationObject
 System.IDisposable
 Improve this Doc
 View Source